//-----------------------------------------------------------------------------------
// 共通
//-----------------------------------------------------------------------------------
MS0001 = '{0}データに該当のデータが存在するため削除できません。(MS0001)';
MS0003 = '変更点がありますが、クリア処理を行いますか？(MS0003)';
MS0004 = '検索条件が設定されていません。(MS0004)';
MS0005 = '入力不可文字が入力されています。(MS0005)';
MS0006 = '検索処理の該当件数は{0}/{1}件です。(MS0006)';
MS0007 = '複数行が選択されています。(MS0007)';
MS0008 = 'パラメータエラーです。(MS0008)';
MS0009 = '入力値に誤りがあります。(MS0009)';
MS0010 = '値が無効です。(MS0010)';
MS0011 = '件数が多すぎます。検索条件を絞ってください。(MS0011)';
MS0012 = '半角{0}文字以内で入力してください。\n全角入力の場合は上記の半分の文字数となります。(MS0012)';
MS0013 = '登録ユーザーではありません。(MS0013)';
MS0014 = 'パスワードが間違っています。(MS0014)';
MS0015 = '終了しました。(MS0015)';
MS0016 = '処理中です。(MS0016)';
MS0017 = '権限が不足しています。(MS0017)';
MS0018 = '実行しますか？(MS0018)';
MS0019 = '{0}が{1}より先の日付になっています。(MS0019)';
MS0020 = '実行しました。(MS0020)';
MS0021 = '桁数が超えています。(MS0021)';
MS0022 = '{0}は有効な値ではありません。(MS0022)';
MS0023 = '{0}が入力可能文字数を超えています。(MS0023)';
MS0024 = 'ログインできませんでした。\n入力値をお確かめください。(MS0024)';
MS0025 = '有効期限が迫っています。パスワードを変更して下さい。(MS0025)';
MS0026 = 'パスワードの有効期限が切れました。パスワードを変更して下さい。(MS0026)';
MS0028 = '期間を正しく入力してください。(MS0028)';
MS0029 = '登録対象明細がありません。(MS0029)';
MS0030 = '変更内容が破棄されます。\nこのまま処理を続けてもよいですか？(MS0030)';
MS0031 = '削除対象明細がありません。(MS0031)';
MS0032 = '{0}の桁数が超えています。(MS0032)';
MS0033 = '日付にエラーがあります。正しい日付を入力して下さい。(MS0033)';
MS0034 = '他のテーブルで使用しているため、更新出来ませんでした。(MS0034)';
MS0035 = '検索条件が変更されました。処理を中止します。(MS0035)';
MS0036 = '保存が終了しました。(MS0036)';
//MS0037 = '該当データが存在しませんでした。(MS0037)';
MS0037 = '該当データが存在しません。(MS0037)';
MS0038 = '変更されていません。(MS0038)';
MS0039 = '削除が終了しました。(MS0039)';
MS0040 = 'コピーが完了しました。(MS0040)';
MS0041 = '計算が終了しました。(MS0041)';
MS0042 = '{0}の入力は必須です。(MS0042)';
MS0043 = '{0}の入力に誤りがあります。(MS0043)';
MS0044 = '{0}を選択してください。(MS0044)';
MS0045 = '{0}が重複しています。(MS0045)';
MS0046 = '複数選択されているため行追加できません。(MS0046)';
MS0047 = '削除する行を選択してください。(MS0047)';
MS0048 = '{0}が変更されているため{1}できません。(MS0048)';
MS0049 = '指定された{0}は存在しません。(MS0049)';
MS0050 = '指定された{0}は未使用となっています。(MS0050)';
MS0051 = '指定された{0}は削除されています。(MS0051)';
MS0052 = '指定されている行数を超えるため追加できません。(MS0052)';
MS0053 = '列または行を指定してください。(MS0053)';
MS0054 = '{0}に入力された年月は存在しません。(MS0054)';
MS0055 = '{0}が存在しません。{1}で登録を行ってください。(MS0055)';
MS0056 = '行を選択してください。(MS0056)';
MS0057 = '{0}の日付入力が不正です。(MS0057)';
MS0058 = 'データが存在しません。(MS0058)';
MS0059 = '複数選択されているため{0}を表示できません。(MS0059)';
MS0060 = '指定年月のＭＲＰ計算処理を行ってください。(MS0060)';
MS0061 = '複数選択されているため行削除できません。(MS0061)';
MS0062 = '当年月のデータはコピーできません。(MS0062)';
MS0063 = '複数選択されているため印刷できません。(MS0063)';
MS0064 = '保存してよろしいですか。(MS0064)';
MS0065 = '変更されていますが検索してよろしいですか。(MS0065)';
MS0066 = '変更内容を破棄して終了しますか。(MS0066)';
MS0067 = '変更されていますが保存してから印刷しますか。(MS0067)';
MS0068 = '削除してよろしいですか。(MS0068)';
MS0069 = '削除すると復元できませんがよろしいですか。(MS0069)';
MS0070 = 'クリアすると復元できませんがよろしいですか。(MS0070)';
MS0071 = '担当者ＩＤ{0}は既にログインされています。ログインしますか？(MS0071)';
MS0072 = '変更されていますが表示してよろしいですか。(MS0072)';
MS0073 = '変更されていますが印刷してから保存しますか。(MS0073)';
MS0074 = '選択工場にデータをコピーしてよろしいですか。(MS0074)';
MS0075 = '選択工場のデータを削除してよろしいですか。(MS0075)';
MS0076 = '変更されていますが保存してから表示しますか。(MS0076)';
MS0077 = '変更されていますが保存してからEXCEL表に出力しますか。(MS0077)';
MS0078 = '仕込量を計算してよろしいですか。(MS0078)';
MS0079 = '予期せぬエラーが発生しました。(MS0079)';
MS0080 = 'サーバの接続に失敗しました。(MS0080)';
MS0081 = 'サーバの切断に失敗しました。(MS0081)';
MS0082 = 'データ・ベースの接続に失敗しました。(MS0082)';
MS0083 = 'データ・ベースの切断に失敗しました。(MS0083)';
MS0084 = 'データの検索に失敗しました。(MS0084)';
MS0085 = '保存できませんでした。(MS0085)';
MS0086 = '{0}のファイルが見つかりません。(MS0086)';
MS0087 = 'データの取得に失敗しました。(MS0087)';
MS0088 = '印刷処理に失敗しました。(MS0088)';
MS0089 = '画面の初期化に失敗しました。(MS0089)';
MS0090 = 'データエラーです。小分ラベルを出力できません。(MS0090)';
MS0091 = 'プリンタの電源が入っていません。(MS0091)';
MS0092 = 'ラベルプリンタエラーです。(MS0092)';
MS0093 = 'ラベルプリンタがオフラインです。エラーを解除して｢OK｣をクリックして下さい。(MS0093)';
MS0094 = 'ラベルプリンタの用紙切れです。エラーを解除して｢OK｣をクリックして下さい。(MS0094)';
MS0095 = 'ラベルプリンタのリボン切れです。エラーを解除して｢OK｣をクリックして下さい。(MS0095)';
MS0096 = 'レシピの重ね登録が不正です。(MS0096)';
MS0097 = '削除できませんでした。(MS0097)';
MS0098 = 'ラベル発行数(バッチ数)の更新に失敗しました。(MS0098)';
MS0099 = '起動パラメータが不正です。(MS0099)';
MS0100 = '受注分類データが存在しません。受注分類マスタで登録を行ってください。(MS0100)';
MS0101 = '受注分類マスタが登録されていません。(MS0101)';
MS0102 = '職場データが存在しません。職場マスタで登録を行ってください。(MS0102)';
MS0103 = '検索時のデータが別のユーザーによって更新されているため保存出来ませんでした。(MS0103)';
MS0104 = 'Excel出力処理に失敗しました。(MS0104)';
MS0105 = 'コピー元データの取得に失敗しました。(MS0105)';
MS0436 = '条件を入力してください。(MS0436)';
MS0438 = '他のユーザーにより内容が変更されているため更新できません。(MS0438)';
MS0439 = '半角英数字を入力してください。(MS0439)';
MS0440 = '整数{0}桁、 少数{1}桁以内の数値を入力してください。(MS0440)';
MS0441 = '数値を入力して下さい。(MS0441)';
MS0442 = 'レコード数が0件です。データ検索後に再度実行してください。(MS0442)';
MS0443 = '行が選択されていません。行選択後に再度実行してください。(MS0443)';
MS0444 = 'データの変更がありません。データを変更後に再度実行してください。(MS0444)';
MS0449 = '月（1～12）を入力してください。(MS0449)';
MS0450 = '{0} 以上、 {1} 以下の数値を入力してください。(MS0450)';
MS0451 = '日本語、英語、中国語のいずれか一つは必須です。(MS0451)';
MS0543 = '品名コードを入力してください。(MS0543)';
MS0553 = '印刷回数の入力に誤りがあります。(MS0553)';
MS0560 = '明細が変更されています。保存もしくは再検索してからEXCEL表に出力してください。(MS0560)';
MS0565 = '関連する仕掛品データが存在します。同時に削除されます。よろしいですか。(MS0565)'
MS0568 = '検索結果{0}件は最大表示件数を超えているため{1}件までの表示となります。検索条件を絞り込んで下さい。(MS0568)';
MS0569 = '製品計画画面で作成された計画です。この画面からは削除できません。(MS0569)'
MS0571 = '{0}文字以上で入力してください。(MS0571)';
MS0572 = 'パスワードには、英数字でない文字が必要です。(MS0572)';
MS0574 = 'パスワードと確認用パスワードが異なります。(MS0574)';
MS0575 = '検索条件が変更されているため、保存できません。検索条件を検索時の状態に戻します。(MS0575)';
MS0576 = '整数{0}桁以内の数値を入力してください。(MS0576)';
MS0618 = '{0}は{1}より大きい数字を入力してください。(MS0618)';
MS0619 = '保存中・・・';
MS0620 = '処理中・・・';
MS0621 = '検索前のため実行できません。(MS0621)';
MS0624 = '検索結果{0}件は最大表示件数を超えているため{1}件までの表示となります。(MS0624)';
MS0666 = '{0}は{1}～{2}の範囲内にして下さい。(MS0666)';
MS0667 = '電話番号を入力してください（例:012-345-6789）。(MS0667)';
MS0668 = '郵便番号を入力してください（例:123-4567）。(MS0668)';
MS0669 = 'FAX番号を入力してください（例:012-345-6789）。(MS0669)';
MS0681 = '最大表示件数を超えているため{0}件までの表示となります。(MS0681)';
MS0683 = '：他のユーザーにより行は既に削除されています。(MS0683)';
MS0688 = '他のテーブルで使用しているため、更新・削除できませんでした。(MS0688)';
MS0699 = '選択可能な行数は{0}行までです。(MS0699)';

//-----------------------------------------------------------------------------------
// 計画 
//-----------------------------------------------------------------------------------
MS0108 = 'ラインコピーが終了しました。(MS0108)';
MS0109 = 'ラインコピー可能なデータが存在しません。(MS0109)';
MS0110 = '工数計画表の出力が完了しました。(MS0110)';
MS0111 = 'EXCELファイルの出力が完了しました。(MS0111)';
MS0112 = '仕込日が遅すぎます。必要日以前の日付を設定してください。(MS0112)';
MS0113 = '処理日が遅すぎます。必要日以前の日付を設定してください。(MS0113)';
MS0114 = '配合重量はＭＡＸ重量以下に設定してください。(MS0114)';
MS0115 = 'Ｂ数には整数を設定してください。(MS0115)';
MS0116 = '製品名を設定してください。(MS0116)';
MS0117 = '帳票を選択してください。(MS0117)';
MS0118 = '一覧が変更されているためラインコピーできません。(MS0118)';
MS0119 = '予想数が入力されていません。(MS0119)';
MS0120 = '端数レシピの取得に失敗しました。配合コード:[{0}] 重量:[{1}](MS0120)';
MS0121 = 'データ部分を選択してください。(MS0121)';
MS0122 = '製品マスタ 、または配合マスタの登録が正しくありません。マスタを確認してください。(MS0122)';
MS0123 = '基本レシピの取得に失敗しました。製品コード:[{0}](MS0123)';
MS0124 = '仕込量が０のため印刷できません。(MS0124)';
MS0125 = '休日が設定されているため入力できません。(MS0125)';
MS0126 = 'データの保存に失敗しました。ラインコピーされていないデータが存在する可能性があります。(MS0126)';
MS0127 = '過去の日付が設定されています。(MS0127)';
MS0128 = '同一日付に休日が複数設定されています。(MS0128)';
MS0129 = 'ラベル発行を行っていないため{0}を表示できません。(MS0129)';
MS0130 = '同一日付に製品と休日が設定されています。(MS0130)';
MS0131 = '関連するデータが未使用もしくは削除されているか、または、\n品管担当フラグ、製造担当フラグのチェックがされていないため、{0}できません。(MS0131)';
MS0132 = '1行目のデータは削除できません。(MS0132)';
MS0133 = '未確定データが存在しているため、印刷できません。(MS0133)';
MS0134 = '{0}月以外には移動できません。再度検索して下さい。(MS0134)';
MS0135 = '{0}日以降にデータがありません。(MS0135)';
MS0136 = '仕込量がマイナス値になってます、確認して下さい。(MS0136)';
MS0137 = 'バッチ出来高が０のため検索できません(MS0137)';
MS0138 = 'コピー元期間の値を正しく入力してください(MS0138)';
MS0139 = '指定された期間の値が正しくありません(MS0139)';
MS0140 = '本日より以前には同数入力できません。同数入力の開始日を正しく入力してください。(MS0140)';
MS0141 = 'コピー先日付が正しくありません。(MS0141)';
MS0142 = '削除できません。(MS0142)';
MS0143 = '必要日が{0}日以降の行を選択してください。(MS0143)';
MS0144 = '表示月翌月に対する計画コピーが実行されています。保存してから実行してください。(MS0144)';
MS0145 = '未使用の製品に対して同数入力できません。(MS0145)';
MS0146 = '仕込量がマイナスのため印刷できません。(MS0146)';
MS0147 = '確定分の仕込量合計がマイナスになる配合があります。{0}(MS0147)';
MS0148 = '確定分の仕込量合計がマイナスになる仕掛品があります。{0}(MS0148)';
MS0149 = '確定分の仕込量合計または製造実績合計がマイナスになる配合があります。{0}(MS0149)';
MS0150 = '仕込量が必要量より少ないですが、保存しますか？(MS0150)';
MS0151 = '過去の日付ですが入力しますか？(MS0151)';
MS0152 = '変更されていますが{0}を実行してよろしいですか？(MS0152)';
MS0153 = '変更されていますが{0}してよろしいですか。(MS0153)';
MS0154 = 'ラインコピーを実行してよろしいですか？(MS0154)';
MS0155 = '現在入力されているコピー先月の計画データは全てクリアされます。よろしいですか？(MS0155)';
MS0156 = '変更されていますが保存してから{0}しますか？(MS0156)';
MS0157 = '配合重量が仕込最大重量を上回っています。保存処理を続けてよろしいですか？(MS0157)';
MS0158 = 'ラインコピーに失敗しました。(MS0158)';
MS0159 = '配合計算で不正な値を使用しました。(MS0159)';
MS0437 = '既に実績値が入力されています。(MS0437)';
MS0448 = 'マスタに不備がある行が存在します。(MS0448)';
MS0682 = '変更した製品のレシピ内に、<br/>既にラベル発行済み、又は修正された計画が存在します。<br/>変更内容をどこまで反映しますか？(MS0682)';
MS0704 = '配合合計重量が0のため、倍率、バッチ数が計算できません。(MS0704)';
MS0708 = '製品計画画面で作成された計画に対しては、この操作はできません。(MS0708)';
MS0713 = '確定されていないため、ラベル印刷できません。（MS0713）';
MS0727 = '調味液フラグ、賞味期間、保管区分、重量、枚数のいずれかが配合マスタに正しく登録されていません。（MS0727）';
MS0799 = '仕込計画が確定済みです。データを保存すると仕込計画が未確定になりますがよろしいですか？(MS0799)';
MS0800 = '仕込計画が確定済みです。データを削除してよろしいですか？(MS0800)';
MS0801 = '{0}が確定済みです。データの{1}はできません。(MS0801)';
MS0802 = 'テスト品のため、使用実績按分区分を製造に設定できません。調整に変更して下さい。(MS0802)';
MS0828 = '休日が設定されているため行追加できません。(MS0828)';

//-----------------------------------------------------------------------------------
// 計算
//-----------------------------------------------------------------------------------
MS0160 = '入力された品コードがマスタ上に存在しません。(MS0160)';
MS0161 = '入力された品コードは削除されています。(MS0161)';
MS0162 = '入力された品コードは未使用です。(MS0162)';
MS0163 = '不良原資材入力画面から入力してください。(MS0163)';
MS0164 = '納入実績が入力されているので納入予定は変更できません。(MS0164)';
MS0720 = '入数、重量のいずれかが 0 のため入力できません。(MS0720)';
MS0733 = '理由、ロケーション、原価センターのいずれかが初期値ではありません。　対象日：{0} (MS0733)';
MS0734 = '複数の{0}が存在するため、保存できません。　対象日：{1} (MS0734)';
MS0736 = '{0}が初期値でない{1}のため保存できません。  対象日：{2} (MS0736)';

//-----------------------------------------------------------------------------------
// 荷受
//-----------------------------------------------------------------------------------
MS0229 = '荷受データ取込が完了しました。(MS0229)';
MS0230 = '反映が完了しました。(MS0230)';
MS0231 = '納入予定からの荷受予定は削除できません。(MS0231)';
MS0232 = '納入予定の{0}が未入力です。(MS0232)';
MS0233 = '納入予定の{0}が未選択です。(MS0233)';
MS0234 = '既に同品、同取引先の予定が同日に設定されております。(MS0234)';
MS0235 = '納入実績数が０となっています。(MS0235)';
MS0236 = '履歴の在庫数がマイナスになる値は保存できません(MS0236)';
MS0238 = '削除対象行ではありません。(MS0238)';
MS0239 = '在庫数が０になっている為、{0}できません。(MS0239)';
MS0240 = '入り数以上の値は入力できません。(MS0240)';
MS0241 = '納入予定からの荷受予定は変更できません。(MS0241)';
MS0243 = '符号の異なるC/S数、端数の入力はできません。(MS0243)';
MS0244 = '最新の荷受日より過去の日時は入力できません。(MS0244)';
MS0245 = '荷受データが作成されていませんので取込できません。(MS0245)';
MS0246 = 'コンバートエラーになったデータが存在します。コンバートエラーリストを確認してください。(MS0246)';
MS0247 = '日付が不正です。日付を正しく入力して下さい。(MS0247)';
MS0248 = '反映対象データが存在しませんでした。(MS0248)';
MS0249 = '変更されていますが{0}してよろしいですか？(MS0249)';
MS0250 = '変更されていますが保存してから{0}しますか？(MS0250)';
MS0251 = '確定データを変動表へ反映してよろしいですか？(MS0251)';
MS0252 = '変更されていますが保存してから確定データを変動表へ反映してよろしいですか？(MS0252)';
MS0253 = '荷受データがゼロ件でした。(MS0253)';
MS0254 = 'データベースへの荷受データの追加でエラーが発生しました。(MS0254)';
MS0255 = '荷受データ取込中にエラーが発生しました。荷受データを確認して下さい。(MS0255)';
MS0256 = '荷受データ取込に失敗しました。{0}(MS0256)';

//-----------------------------------------------------------------------------------
// 日報
//-----------------------------------------------------------------------------------
MS0165 = '受注数の取込が終了しました。(MS0165)';
MS0166 = '設定を完了しました。(MS0166)';
MS0167 = '納入データ送信が終了しました。(MS0167)';
MS0168 = '確定済みのデータは{0}できません。(MS0168)';
MS0169 = 'デポマスタの登録が正しくありません。デポマスタを確認し、データを登録してください。(MS0169)';
MS0170 = '庫入数または経費使用数が入力されていません。(MS0170)';
MS0171 = '製造実績がありません。(MS0171)';
MS0172 = '伝送済みのデータは{0}できません。(MS0172)';
MS0173 = '在庫より多く庫出できません。(MS0173)';
MS0174 = 'その行は既に選択されています。(MS0174)';
MS0175 = 'コード、ロットNo.、荷受日、荷受時刻が重複する行が存在します。(MS0175)';
MS0176 = '{0}行目にコード、ロットNo.、荷受日、荷受時刻が重複する行が存在します。(MS0176)';
MS0177 = '使用分・未使用分を選択して下さい。(MS0177)';
MS0178 = '該当データが存在しませんでした。または指定年月のＭＲＰ計算処理が行われていません。(MS0178)';
MS0179 = '登録済みのデータは{0}できません。(MS0179)';
MS0180 = '指定されたコードは変動表データに存在しません。(MS0180)';
MS0181 = '原資材コード、庫場所コードが重複しています。(MS0181)';
MS0182 = '確定済みのデータは{0}できません。(MS0182)';
MS0183 = '該当データが存在しません。またはこの職場・ラインで製造可能な仕掛品ではありません。(MS0183)';
MS0184 = '確定・未確定を選択して下さい。(MS0184)';
MS0185 = '対象・対象外を選択して下さい。(MS0185)';
MS0186 = '検索条件の{0}が指定されています。指定された{0}以外に変更できません。(MS0186)';
MS0187 = '庫出数が在庫数より多く入力されました。よろしいですか？(MS0187)';
MS0188 = '原資材コード、庫場所コードが重複していますが、保存してもよろしいですか？(MS0188)';
MS0189 = '変更されていますが全品表示してよろしいですか？(MS0189)';
MS0190 = '納入予定データを送信します。よろしいですか？(MS0190)';
MS0191 = 'データの送信に失敗しました。(MS0191)';
MS0747 = '仕掛品使用量が合計値と合致していません。(MS0747)';
MS0748 = '伝送待ちもしくは伝送中のデータは変更できません。(MS0748)';
MS0749 = '伝送処理中のため、処理できません。(MS0749)';
MS0751 = '使用実績按分区分が調整の場合は、製造検索はできません。(MS0751)';
MS0452 = '{0}計画が存在する為、削除できません。(MS0452)';
MS0616 = '仕掛品に対する製造可能ラインデータが存在しないため登録出来ません。データを確認してください。(MS0616)';
MS0657 = 'この職場・ラインで製造可能なコードではありません。(MS0657)';
MS0664 = 'コード入力後にラインコードの入力が有効となります。(MS0664)';
MS0752 = '伝送済の按分データが削除されますが、よろしいですか？(MS0752)';
MS0753 = '実績数を0で確定する場合は、削除してください。(MS0753)';
MS0754 = '製品ロット番号{0}は使用予実按分データに存在するため、保存できません。(MS0754)';
MS0762 = '使用実績に伝送済みもしくは伝送待ちのデータがあります。<br />未伝送状態になりますので、再度伝送をしてください。(MS0762)';
MS0763 = '使用実績にデータがあります。<br />使用実績も削除されますので、再度製造実績選択を行ってください。(MS0763)';
MS0764 = '計算在庫数が実在庫として登録されます。実行してよろしいですか。(MS0764)';
MS0765 = '明細が変更されてる為、計算在庫数を実在庫としてコピーできません。(MS0765)';
MS0766 = '理由コードが{0}の行は削除できません。(MS0766)';
MS0773 = '残計上コードが品名マスタに存在しません。登録してください。(MS0773)';
MS0774 = '賞味期間が品名マスタに登録されていません。(MS0774)';
MS0778 = '残実績がありません。(MS0778)';
MS0781 = '使用実績按分区分が残の場合は、製造検索はできません。(MS0781)';
MS0787 = '{0}の在庫はまだ伝送されていません。(MS0787)';
//MS0788 = '{0}の前回送信データを削除します。実行してよろしいですか。(MS0788)';
//MS0789 = '{0}の前回送信データを削除しました。在庫再伝送されるまでしばらくお待ち下さい。(MS0789)';
MS0794 = '仕込日より過去の日付は入力できません。(MS0794)';
MS0804 = '検索条件の在庫日付で在庫伝送処理を行います。よろしいですか？(MS0804)';
MS0805 = '在庫伝送処理が完了しました。(MS0805)';
MS0806 = '製品の場合、製造実績数は整数のみ保存できます。(MS0806)';
MS0823 = '他のユーザーにより内容が変更されているため更新できません。再検索を行い、データを更新してください。(MS0823)';
MS0829 = '予定・実績がともに０の場合、保存できません。０以外の実績数を入力してください。(MS0829)';
MS0831 = '保存済の行は品名コードを変更することができません。 該当行を削除後、再度情報を追加してください。(MS0831)';

//-----------------------------------------------------------------------------------
// 納入
//-----------------------------------------------------------------------------------
MS0192 = '納入計画の作成が終了しました。(MS0192)';
MS0193 = '変動計算初日は、翌日以降に設定してください。(MS0193)';
MS0194 = '変動計算初日から変動計算末日の範囲が62日以上です。(MS0194)';
MS0195 = '変動計算初日が変動計算末日より大きくなっています。(MS0195)';
MS0196 = '連続設定する納入書番号を入力してください。(MS0196)';
MS0197 = '検索条件が変更されている為、印刷できません。(MS0197)';
MS0198 = '納入予定が存在する為、削除できません。(MS0198)';
MS0199 = '翌月発注数入力時は入庫予定日も入力してください。(MS0199)';
MS0200 = '入庫予定日入力時は翌月発注数も入力してください。(MS0200)';
MS0201 = '原資材コードと取引先が重複しています。(MS0201)';
MS0202 = '検索日付よりも先の日付を入力してください。(MS0202)';
MS0203 = '入庫予定日は同一年月にしてください。(MS0203)';
MS0204 = '伝送済みの為、削除できません。(MS0204)';
MS0205 = '納入単位が{0}の場合、端数は入力できません。(MS0205)';
MS0206 = '日付の入力が正しくありません。開始日から終了日までの期間を31日以内にしてください。(MS0206)';
MS0207 = '1行に入力可能な文字数は50文字までです。50文字を超えています。改行してください。(MS0207)';
MS0208 = '入力可能な行数は３行までです。3行を超えています。行数を３行にしてください。(MS0208)';
MS0209 = '1行選択してください。(MS0209)';
MS0210 = '納入予定が存在する為、原資材を変更できません。(MS0210)';
MS0211 = '伝送済データは変更できません。(MS0211)';
MS0212 = '印刷対象データが存在しなかった為、印刷されませんでした。(MS0212)';
MS0213 = '拡大印刷は20日以内の期間でのみ可能です。(MS0213)';
MS0214 = '{0}は現在の日付以降の日付を入力してください。(MS0214)';
MS0215 = '納入予定日が納入可能な日付ではありません。(MS0215)';
MS0216 = '変更された行で確定された行がありません。(MS0216)';
MS0217 = '伝送予定日が検索時に指定された伝送予定日の範囲外です。(MS0217)';
MS0218 = '納入予定日が検索時に指定された納入予定日の範囲外です。(MS0218)';
MS0219 = '伝送予定日から算出される納入予定日が検索時に指定された納入予定日の範囲外になります。(MS0219)';
MS0220 = '変動計算初日を変更します。よろしいですか？(MS0220)';
MS0221 = '納入計画を作成します。よろしいですか？(MS0221)';
MS0222 = '既に作成されている納入計画は破棄されますがよろしいでしょうか？(MS0222)';
MS0223 = '全件を印刷します。よろしいですか？(MS0223)';
MS0224 = '表示された原資材を全選択します。よろしいですか？(MS0224)';
MS0225 = '変更されていますが保存してから選択しますか。(MS0225)';
MS0226 = '変更された行で確定されていない行があります。未確定データはキャンセルされます。よろしいでしょうか？(MS0226)';
MS0227 = '納入計画の作成に失敗しました。(MS0227)';
MS0228 = '製造計画を作成します。よろしいですか？(MS0228)';
MS0595 = '指定された原資材コードには、使用できる取引先が存在しません。(MS0595)';
MS0654 = '出力ページ数が10ページを超えているため、出力に時間がかかりますがよろしいですか？(MS0654)';
MS0655 = '出力が完了するまで画面の操作を行わないでください。(MS0655)';
MS0679 = '作成に時間がかかる場合がありますが、よろしいですか？(MS0679)';
MS0680 = '最大出力数の{0}ページを超えているため、出力できません。(MS0680)';
MS0738 = '納入予定がある場合、納入予定日の入力は必須です。(MS0738)';
MS0739 = '変更先の日付にすでに納入予定が存在します。(MS0739)';
MS0741 = '納入計画の作成が終了しました。同日に納入予定が複数件あるため処理をしなかった品名があります、確認してください。(MS0741)';
MS0750 = '荷受実績が存在するため、削除できません。(MS0750)';
MS0809 = '納入予定数が０となっています。(MS0809)';

//-----------------------------------------------------------------------------------
// 風袋決定マスタ
//-----------------------------------------------------------------------------------
MS0002 = '%1画面で仕掛品は選択できません。(MS0002)';
MS0702 = '風袋の選択は追加行のみ有効です。(MS0702)';

//-----------------------------------------------------------------------------------
// マスタ
//-----------------------------------------------------------------------------------
MS0257 = '権限の一つを選択してください。(MS0257)';
MS0258 = '合計行は削除できません。(MS0258)';
MS0259 = '合計行の移動はできません。(MS0259)';
MS0260 = '配合重量を入力してください。(MS0260)';
MS0261 = '「重ね」の状態区分を統一して下さい。(MS0261)';
MS0262 = '最下位行以外を選択してください(MS0262)';
MS0263 = '入力された{0}はシステムで使用するコードのため登録できません。(MS0263)';
MS0264 = '入力された{0}は登録済みです。変更は詳細ボタンから行ってください。(MS0264)';
MS0265 = '「重ね」は８件までです。(MS0265)';
MS0266 = '次に作成可能な版は「{0}版」です。(MS0266)';
MS0267 = 'レシピには「原料」、「仕掛品」、「前処理原料」、「作業手順」のみ登録可能です。(MS0267)';
MS0268 = '次に作成可能な工程は「{0}工程」です。(MS0268)';
MS0269 = '入力した{0}は他の職場に登録されている為、保存できません。(MS0269)';
MS0271 = '品区分に対応するマークを設定して下さい。(MS0271)';
MS0272 = '荷姿重量・荷姿数の入力はセットです。(MS0272)';
MS0273 = '小分重量・小分数・風袋の入力はセットです。(MS0273)';
MS0274 = '指定行のマークでは風袋の登録はできません。(MS0274)';
MS0275 = '行を追加してください。(MS0275)';
MS0276 = '合計行にデータの設定はできません。(MS0276)';
MS0277 = 'このユーザでは作業指示以外の行削除はできません。(MS0277)';
MS0278 = 'このユーザでは作業指示以外の行上移動はできません。(MS0278)';
MS0279 = 'このユーザでは作業指示以外の行下移動はできません。(MS0279)';
MS0280 = 'このユーザでは作業指示以外のマーク設定はできません。(MS0280)';
MS0281 = '行追加は99行以上はできません。(MS0281)';
MS0282 = 'このユーザでは作業指示データ以外の品名変更はできません。(MS0282)';
MS0283 = 'このユーザでは作業指示データ以外のマーク変更はできません。(MS0283)';
MS0284 = 'このユーザでは作業指示データ以外の風袋変更はできません。(MS0284)';
MS0285 = '配合重量と等しい基本重量を入力してください。(MS0285)';
MS0286 = '同一職場のラインを入力してください。(MS0286)';
MS0287 = '入力された製品は、受注製品ではありません。(MS0287)';
MS0288 = '{0}マスタが登録されていません。(MS0288)';
MS0289 = '入力された{0}コードは{1}マスタにおいて登録済みです。(MS0289)';
MS0290 = '荷姿重量の入力は4桁までです。(MS0290)';
MS0291 = '有効日付が他のレシピと重なる為、保存できません。(MS0291)';
MS0292 = '使用資材に製造使用製品が含まれています。(MS0292)';
MS0293 = '一個の量と使用単位は同じ単位を設定して下さい。(MS0293)';
MS0294 = '比重が０になっている為､保存できません｡(MS0294)';
MS0295 = 'この取引先は原資材購入先マスタに登録されています。仕入先以外に変更できません。(MS0295)';
MS0296 = 'この取引先は原資材購入先マスタに登録されています。仕入先、売上/仕入以外に変更できません。(MS0296)';
MS0297 = 'コード：{0}は製造可能ラインとして登録されています。削除できません。(MS0297)';
MS0298 = 'コード：{0}にはラインが登録されています。削除できません。(MS0298)';
MS0299 = '検索条件が変更されています。再度検索をし直してください。(MS0299)';
MS0300 = '指定原料のためで{0}きません。(MS0300)';
MS0301 = 'すべてゼロでの登録はできません。(MS0301)';
MS0302 = '{0}に使用出来ない文字が含まれています。(MS0302)';
MS0303 = '{0}に認識できない変数名が含まれています。(MS0303)';
MS0304 = '{0}の構文が正しくありません。(MS0304)';
MS0305 = '『{0}』入力時には、必ず『{1}』を入力して下さい。(MS0305)';
MS0306 = '『新単価切替日』は本日以降で入力して下さい。(MS0306)';
MS0307 = '使用容器の選択は{0}つまでです。(MS0307)';
MS0308 = 'オンライン用リードタイムは1以上の数字を入力して下さい。(MS0308)';
MS0309 = '取引先区分が『{0}』の場合、最低一つの便に使用チェックを入れて下さい。(MS0309)';
MS0310 = '二次歩留は歩留以上になるよう入力してください。(MS0310)';
MS0311 = '1版の削除は全版のレシピを全て削除します。削除してよろしいですか。(MS0311)';
MS0312 = '指定の配合重量のレシピを削除してよろしいですか。(MS0312)';
MS0313 = '指定の版のレシピを削除してよろしいですか。(MS0313)';
MS0314 = '指定の工程のレシピを削除してよろしいですか。(MS0314)';
MS0315 = '指定原料を解除してよろしいですか。(MS0315)';
MS0316 = 'ラベル発行枚数の合計が０枚です。ラベル発行されませんがよろしいですか？(MS0316)';
MS0573 = '品名登録がされていません。品名登録後にライン登録を行ってください。(MS0573)';
MS0578 = '工程が空白のため、この操作は実行できません。(MS0578)';
MS0614 = '新規版のため詳細画面を開けません。(MS0614)';
MS0622 = '配合コード、有効開始日付が重複するデータが存在しています。(MS0622)';
MS0623 = '新規追加時は画面遷移できません。(MS0623)';
MS0678 = '1版が未使用のため実行できません。(MS0678)';
MS0705 = '新規版のため印刷できません。(MS0705)';
MS0709 = '他担当者の変更はできません。(MS0709)';
MS0721 = '注意喚起の選択は追加行のみ有効です。(MS0721)';
MS0745 = '配合コードと同じ仕掛品コードがレシピに含まれているため、登録できません。(MS0745)';
MS0746 = '実績確定されていない計画が存在します。変更を反映するためには計画の再立案をしてください。(MS0746)';
MS0767 = '重ねの場合はシステム外小分対象または対象外を統一してください。(MS0767)';
MS0771 = '選択したマークでは、1kg以上の小分重量を指定できません。(MS0771)';
MS0777 = '既に他の自家原料に登録されている配合コードです。(MS0777)'
MS0782 = '同じ重ねのマークは１セットまでです。(MS0782)'

MS0790 = '{0}または{1}の入力は必須です。(MS0790)';
//-----------------------------------------------------------------------------------
// メニュー
//-----------------------------------------------------------------------------------
MS0106 = '他のユーザーがＭＲＰ計算処理を行っている為、ログインできません。(MS0106)';
MS0107 = '終了してよろしいですか｡(MS0107)';

//-----------------------------------------------------------------------------------
// ラベル
//-----------------------------------------------------------------------------------
MS0336 = '印刷を完了しました。ラベルを確認してください。(MS0336)';
MS0337 = '印刷を中止しました。(MS0337)';
MS0338 = '印刷が完了しました。(MS0338)';
MS0339 = '印刷するラベルは　{0}　です。ラベルプリンタを確認して下さい。(MS0339)';
MS0340 = 'ラベルが切り替わりました。次のラベルは　{0}　です。ラベルを取り替えて、OKをクリックして下さい。(MS0340)';
MS0341 = '印刷指示の送信を終了しました。全てのラベルが発行されたことを確認し、\nラベルプリンタの取り消しキーを押した後、「OK」をクリックして下さい。(MS0341)';
MS0342 = '処理が正常終了しました。(MS0342)';
MS0343 = '製品マスタに登録がありません。(MS0343)';
MS0344 = '取引先マスタに登録がありません。(MS0344)';
MS0345 = '入力値と項目種別が合っていません。(MS0345)';
MS0346 = 'これ以上行追加できません。(MS0346)';
MS0347 = '既にデータが存在します。登録できませんでした。(MS0347)';
MS0348 = 'データが存在しません。更新できませんでした。(MS0348)';
MS0349 = 'データが存在しません。削除できませんでした。(MS0349)';
MS0350 = '半角文字が入っています。印字内容を確認してください。(MS0350)';
MS0351 = '全角文字が入っています。印字内容を確認してください。(MS0351)';
MS0352 = '全角は128文字までです。半角は256文字までです。(MS0352)';
MS0353 = '行を選択してください。(MS0353)';
MS0354 = '必須項目です。入力してください。(MS0354)';
MS0355 = '採用のチェックが複数あります。(MS0355)';
MS0356 = '入力文字が桁数よりも多いです。(MS0356)';
MS0357 = '採用のチェックがありません。(MS0357)';
MS0358 = 'シンボルデータ内容が1件もありません。(MS0358)';
MS0359 = '登録するラベルデータが1件もありません。(MS0359)';
MS0360 = 'ラベルの縦サイズより設定値がオーバーしています。(MS0360)';
MS0361 = 'ラベルの横サイズより設定値がオーバーしています。(MS0361)';
MS0362 = '印刷中のデータが失われてしまいますので、電源は切らずにラベルプリンタを再セット後、OKをクリックして下さい。(MS0362)';
MS0363 = 'プリンタがオフラインです。プリンタをオンラインにした後、OKをクリックして下さい。(MS0363)';
MS0364 = 'ラベルプリンタの電源が入っていません。電源を入れてOKをクリックして下さい。(MS0364)';
MS0365 = 'ラベルプリンタの準備が出来ていません。印刷を中止します。(MS0365)';
MS0366 = '該当データが存在しませんでした。(MS0366)';
MS0367 = '既に見込数プラスされています。(MS0367)';
MS0368 = '一覧が変更されていますが、検索を続行しますか？(MS0368)';
MS0369 = '終了してもよろしいでしょうか？(MS0369)';
MS0370 = 'ラベルを発行してもよろしいでしょうか？(MS0370)';
MS0371 = '項目種別を変更しますよろしいですか？(MS0371)';
MS0372 = '行削除してもよろしいですか？(MS0372)';
MS0373 = '変更されていますが選択してから終了しますか？(MS0373)';
MS0374 = '出力データが破棄されます。印刷を中止しますか？(MS0374)';
MS0375 = '変更を保存してラベルを発行しますか？(MS0375)';
MS0376 = '一覧が変更されていますが、検索条件を変更しますか？(MS0376)';
MS0377 = 'ラベルプリンタのステータスが取得できません。印刷を中止しますか？(MS0377)';
MS0378 = '変更されていますが印刷してから終了しますか？(MS0378)';
MS0379 = '見込数を必要数にプラスします。よろしいですか？(MS0379)';
MS0380 = '発行データをクリアします。よろしいですか？(MS0380)';
MS0381 = '印刷しますがよろしいでしょうか？(MS0381)';
MS0382 = '個別設定を取得できないエラーが発生しました。(MS0382)';
MS0383 = '発行枚数が不正です。(MS0383)';
MS0384 = '発行枚数を更新できません。(MS0384)';
MS0385 = '並び替えでエラーが発生しました。(MS0385)';
MS0386 = '検索でエラーが発生しました。(MS0386)';
MS0387 = 'ラベルマスタが取得できません。(MS0387)';
MS0388 = 'ラベルデータ(シフトJIS変換)でエラーが発生しました。(MS0388)';
MS0389 = 'ラベルの内容が取得できません。(MS0389)';
MS0390 = 'ラベルプリンタの印刷中止でエラーが発生しました。(MS0390)';
MS0391 = 'ラベルプリンタのステータスが取得できません。(MS0391)';
MS0392 = 'ラベルプリンタのセンサーエラーです。(MS0392)';
MS0393 = 'ラベルプリンタのヘッドエラーです。(MS0393)';
MS0394 = 'ラベルプリンタの前面カバーが開いています。(MS0394)';
MS0395 = 'ラベルプリンタのカッタエラーです。(MS0395)';
MS0396 = 'ラベルプリンタのその他のエラーです。(MS0396)';
MS0397 = 'ラベルプリンタのメディアエラーです。(MS0397)';
MS0398 = 'ラベルプリンタのカッタセンサエラーです。(MS0398)';
MS0399 = 'ラベルプリンタがスタッカorリワインダフルです。(MS0399)';
MS0400 = 'キーで指定したロット№のレコードが存在しません。(MS0400)';
MS0401 = 'SQLコマンドの実行に失敗しました。(MS0401)';
MS0402 = '{0}件目のラベルが発行できません。(MS0402)';
MS0403 = '印刷に失敗しました。(MS0403)';
MS0404 = 'ラベルプリンタのヘッドがロックされていません。エラーを解除して｢OK｣をクリックして下さい。(MS0404)';
MS0405 = 'カッタ動作が不正です。エラーを解除して｢OK｣をクリックして下さい。(MS0405)';
MS0406 = 'ラベルデータでエラーが発生しました。(MS0406)';
MS0407 = 'ラベルプリンタのパラメータエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0407)';
MS0408 = 'ラベルプリンタのバーコードタイプエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0408)';
MS0409 = 'ラベルプリンタの二次元コードフォーマットエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0409)';
MS0410 = 'ラベルプリンタの二次元コードイメージエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0410)';
MS0411 = 'ラベルプリンタの印字濃度エラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0411)';
MS0412 = 'ラベルプリンタのオプションパラメータエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0412)';
MS0413 = 'ラベルプリンタのコマンドエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0413)';
MS0414 = 'ラベルサイズエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0414)';
MS0415 = 'ラベルプリンタの外部フォントエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0415)';
MS0416 = 'ラベルプリンタのマクロエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0416)';
MS0417 = 'ラベルプリンタのコマンド文字列エラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0417)';
MS0418 = 'ラベルプリンタのイメージエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0418)';
MS0419 = 'ラベルプリンタのカウンタエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0419)';
MS0420 = 'ラベルプリンタのカバーが空いています。エラーを解除して｢OK｣をクリックして下さい。(MS0420)';
MS0421 = 'ラベルプリンタのエラーメッセージの取得に失敗しました。(MS0421)';
MS0422 = 'ラベルプリンタのヘッドが上がっています。エラーを解除して｢OK｣をクリックして下さい。(MS0422)';
MS0423 = 'ラベルのギャップがありません。エラーを解除して｢OK｣をクリックして下さい。(MS0423)';
MS0424 = 'ラベルのマークがありません。エラーを解除して｢OK｣をクリックして下さい。(MS0424)';
MS0425 = 'ラベルプリンタのバッファがいっぱいです。エラーを解除して｢OK｣をクリックして下さい。(MS0425)';
MS0426 = 'ラベルプリンタのその他のエラーです。エラーを解除して｢OK｣をクリックして下さい。(MS0426)';
MS0427 = 'バーコード化する文字または桁数が不正です。エラーを解除して｢OK｣をクリックして下さい。(MS0427)';
MS0428 = '印刷するデータが不正です。エラーを解除して｢OK｣をクリックして下さい。(MS0428)';
MS0429 = '印刷指定したアイテムがラベルプリンタに登録されていません。エラーを解除して｢OK｣をクリックして下さい。(MS0429)';
MS0430 = 'ラベルのギャップまたはマークがありません。エラーを解除して｢OK｣をクリックして下さい。(MS0430)';
MS0431 = 'ラベルプリンタのカバーがあがっています。エラーを解除して｢OK｣をクリックして下さい。(MS0431)';
MS0432 = '{0}が不正です。ラベルを出力できません。(MS0432)';
MS0433 = '二次元コード化するデータの桁数が不正です。(MS0433)';
MS0434 = '発行データクリア処理に失敗しました。(MS0434)';
MS0435 = '見込数プラス処理に失敗しました。(MS0435)';
MS0706 = '印刷できるラベルがありません。(MS0706)';

//-----------------------------------------------------------------------------------
// 小分け
//-----------------------------------------------------------------------------------
MS0500 = '{0}が{1}より大きくなっています。(MS0500)';
MS0501 = '秤量範囲が重複しています。(MS0501)';
MS0502 = '秤量値（下）は秤量値（上）よりも小さい値を入力して下さい。(MS0502)';

//-----------------------------------------------------------------------------------
// 資材使用マスタ
//-----------------------------------------------------------------------------------
MS0691 = '有効日付が他の版と重なる為、保存できません。(MS0691)';
MS0692 = '登録できる資材の件数は{0}件までです。(MS0692)';
MS0687 = '該当製品で使用している全ての版が削除されます。削除してよろしいですか？(MS0687)';
MS0700 = '既に新規版が選択されています。(MS0700)';

//-----------------------------------------------------------------------------------
// 原価
//-----------------------------------------------------------------------------------
MS0722 = '既に作成されている原価単価は破棄されますがよろしいでしょうか？(MS0722)';
MS0723 = '原価単価を作成します。よろしいですか？(MS0723)';
MS0724 = '原価単価の作成が終了しました。(MS0724)';

//-----------------------------------------------------------------------------------
// その他
//-----------------------------------------------------------------------------------
MS0317 = 'MRP計算が終了しました。(MS0317)';
MS0318 = '仕込実績データ取込が終了しました。(MS0318)';
MS0319 = '出庫データ取込が終了しました。(MS0319)';
MS0320 = '使用原料データ取込が完了しました。(MS0320)';
MS0321 = '残数が全て０です。(MS0321)';
MS0322 = 'MRP計算が異常終了しました。(MS0322)';
MS0323 = '事故防サーバーへの接続文字列取得に失敗しました。(MS0323)';
MS0324 = 'マージエージェントのジョブ名が正しくありません。(MS0324)';
MS0325 = 'マージエージェントのジョブ起動に失敗しました。(MS0325)';
MS0326 = '実績データの更新に失敗しました。(MS0326)';
MS0327 = 'ライン稼働予実の更新に失敗しました。(MS0327)';
MS0328 = '仕込サマリーの更新に失敗しました。(MS0328)';
MS0329 = '出庫データの更新に失敗しました。(MS0329)';
MS0330 = '処理の実行を取り消しました。(MS0330)';
MS0331 = '処理に失敗しました。(MS0331)';
MS0332 = '終了してよろしいですか｡(MS0332)';
MS0333 = '変更されていますが終了してよろしいですか｡(MS0333)';
MS0334 = 'MRP計算を行いますか？(MS0334)';
MS0335 = '{0}処理を実行してもよろしいですか？(MS0335)';
MS0615 = '計算在庫が存在しません。計算在庫処理を行ってください。(MS0615)';
MS0689 = '変更されていますが計画作成画面に遷移してよろしいですか？(MS0689)';
MS0694 = '既に作成されている計算在庫は破棄されますがよろしいでしょうか？(MS0694)';
MS0695 = '計算在庫を作成します。よろしいですか？(MS0695)';
MS0696 = '計算在庫の作成が終了しました。(MS0696)';
MS0697 = '在庫計算開始日から在庫計算末日の範囲が62日以上です。(MS0697)';
MS0698 = '在庫計算開始日が在庫計算末日より大きくなっています。(MS0698)';
MS0716 = '開始日から終了日の範囲が {0}日以上です。(MS0716)';
MS0717 = '重ね小分の枚数が一致していません。配合レシピを確認してください。(MS0717)';
MS0726 = '納入リードタイムを加味する場合、終了日の入力は必須です。(MS0726)';
MS0732 = '調味液にチェックが付いている場合、{0}の入力は必須です。(MS0732)';
MS0735 = '調整数は0で保存できません(MS0735)';

//-----------------------------------------------------------------------------------
// 日報
MS0783 = '下記トレース用ロットデータのロットも削除されますがよろしいですか？ (MS0783)';
//-----------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------
// トレース
//-----------------------------------------------------------------------------------
MS0685 = '日付のいずれかにチェックは必須です。（MS0685）';
MS0686 = '日付の入力が正しくありません。{0}開始から終了までの期間を 6月 以内にしてください。(MS0686)';
MS0701 = '検索結果{0}件は最大表示件数を超えているため{1}件までの表示となります。検索条件を絞り込むか、Excelで表示してください。(MS0701)';

MS0784 = '原資材コードが変更されていますが保存しますか？ (MS0784)';
MS0785 = '原料ロット番号が選択されておりません。 (MS0785)';
MS0786 = '該当データが存在しません。または原料、自家原料ではありません。(MS0786)';